perf/proxy1.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm up
      duration: 60
      arrivalRate: 5
    - name: Ramp
      duration: 120
      arrivalRate: 5
      rampTo: 50
    - name: High Load
      duration: 300
      arrivalRate: 50

scenarios:
  - name: Proxy1 (/proxy)
    flow:
      - get:
          url: '/proxy/5'