perf/root.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    nodes:
      target: 'http://localhost:5555/nodes'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-nodes"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    gunicorns:
      target: 'http://localhost:5555/gunicorns'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorns"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 120
      arrivalRate: 30

scenarios:
  - name: Ping! (/ping)
    flow:
      - get:
          url: '/ping'